# ElementNode Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementNode Class
Members See Also
---
A render node that represents an element, including the host document containing the element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public class ElementNode : RenderNode
```

Visual Basic
---
```text
Public Class ElementNode _
	Inherits RenderNode
```

Visual C++
---
```text
public ref class ElementNode : public RenderNode
```

# Remarks
See also: [!:Autodesk::Revit::DB::IExportContext2D::OnElementBegin2D]. See also: [!:Autodesk::Revit::DB::IExportContext2D::OnElementEnd2D].
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..RenderNode Autodesk.Revit.DB..::..ElementNode
# See Also
ElementNode Members
Autodesk.Revit.DB Namespace